Kingstonecn/ESP32-S3-RLCD-Monitor/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Octal PSRAM for the LVGL framebuffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Larger main stack (LVGL drawing on the main loop)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Flash / partitions
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# HTTP client + cJSON
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# Logging — verbose during bring-up; drop to W in release
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
